[
  {
    "Context": "BAE Systems Information and Electronic Systems, Fort Wayne, Indiana, was awarded a $459,802,408 order-dependent contract for AN/ARC-231/A Multi-mode Aviation Radio Suite hardware components, repair services and technical/engineering/logistic support. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of April 9, 2034. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W56JSR-24-D-0002).",
    "Date": "April 10, 2024",
    "What is the company that was awarded the contract?": "BAE Systems Information and Electronic Systems",
    "Where is the company that was awarded the contract located?": "Fort Wayne, Indiana",
    "What is the amount awarded?": "$459,802,408",
    "What is the contract awarded for?": "AN/ARC-231/A Multi-mode Aviation Radio Suite hardware components, repair services and technical/engineering/logistic support",
    "Where will the work be performed?": "determined with each order",
    "When is the contract expected to be completed by?": "April 9, 2034",
    "What is the contracting activity?": "Army Contracting Command",
    "Where is the contracting activity located?": "Aberdeen Proving Ground, Maryland",
    "What is the contract number?": "W56JSR-24-D-0002",
    "What is the type of contract?": "order-dependent",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Golden Sands General Contractors Inc., Richmond, Virginia, is being awarded an $11,757,000 firm-fixed-price contract for construction of the Vertical Electro-Magnetic Pulse Simulator (VEMPS) at Patuxent River Naval Air Station.  The work to be performed provides for the construction of a new VEMPS facility which is a small shelter to house the VEMP generator.  Work will be performed in Patuxent River, Maryland, and is expected to be completed by June 2017.  Fiscal 2016 research, development, test and evaluation, (Navy) contract funds in the amount of $11,757,000 are obligated on this award and will not expire at the end of the current fiscal year.  This contract was competitively procured via the Navy Electronic Commerce Online website with two proposals received.  The Naval Facilities Engineering Command, Washington, Washington, District of Columbia, is the contracting activity (N40080-16-C-3015).",
    "Date": "April 21, 2016",
    "What is the company that was awarded the contract?": "Golden Sands General Contractors Inc.",
    "Where is the company that was awarded the contract located?": "Richmond, Virginia",
    "What is the amount awarded?": "$11,757,000",
    "What is the contract awarded for?": "construction of the Vertical Electro-Magnetic Pulse Simulator (VEMPS) at Patuxent River Naval Air Station",
    "Where will the work be performed?": "Patuxent River, Maryland",
    "When is the contract expected to be completed by?": "June 2017",
    "What is the contracting activity?": "Naval Facilities Engineering Command",
    "Where is the contracting activity located?": "Washington, District of Columbia",
    "What is the contract number?": "N40080-16-C-3015",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "General Dynamics NASSCO-Bremerton, Bremerton, Washington, is awarded a $34,305,282 modification to previously awarded contract N00024-14-C-4321 to exercise an option for repair and alteration requirements for USS Carl Vinson (CVN 70) fiscal 2019 dry-docking planned incremental availability (DPIA). The DPIA is the opportunity in the ship’s life cycle to conduct repairs and alterations.  The option will authorize the fourth major availability of the contract, and entails modification and repair of ship equipment, hull and systems. Work will be performed in Bremerton, Washington, and is expected to be completed by July 2020. Fiscal 2019 operations and maintenance (Navy) funding in the amount of $34,305,282 will be obligated at time of award and will expire at the end of the current fiscal year.  Puget Sound Naval Shipyard and Intermediate Maintenance Facility, Bremerton, Washington, is the contracting activity.",
    "Date": "Feb. 8, 2019",
    "What is the company that was awarded the contract?": "General Dynamics NASSCO-Bremerton",
    "Where is the company that was awarded the contract located?": "Bremerton, Washington",
    "What is the amount awarded?": "$34,305,282",
    "What is the contract awarded for?": "repair and alteration requirements for USS Carl Vinson (CVN 70) fiscal 2019 dry-docking planned incremental availability (DPIA)",
    "Where will the work be performed?": "Bremerton, Washington",
    "When is the contract expected to be completed by?": "July 2020",
    "What is the contracting activity?": "Puget Sound Naval Shipyard and Intermediate Maintenance Facility",
    "Where is the contracting activity located?": "Bremerton, Washington",
    "What is the contract number?": "N00024-14-C-4321",
    "What is the type of contract?": "",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, is being awarded a sole-source, cost-plus-incentive-fee and cost-plus fixed-fee contract.  The total value of this contract is $724,001,438, inclusive of all options.  Under this follow on contract, the contractor will conduct full development and lifecycle engineering for the Aegis Weapon System (AWS) fielding for cruisers, destroyers and Aegis Ashore configurations.  The AWS contract will support the following efforts:  Aegis Baseline (BL) 5.4.1 (Ballistic Missile Defense (BMD) 4.2) development; BL 9 (BMD 5.X) development; Aegis BMD In-Service support; BMD ground and flight test support; modeling and simulation support; Aegis Ashore Missile Defense Test Complex combat system engineering, testing, site support, modernization, technical and logistics support; and Aegis BMD ship installation and planning.  The work will be performed in Moorestown, New Jersey, with an estimated completion date of February 2024.  Fiscal 2020 and fiscal 2021 research, development, test, and evaluation; and fiscal 2021 procurement defense wide, and operations and maintenance funds in the amount of $45,036,867, will be obligated at the time of award.  The Missile Defense Agency, Dahlgren, Virginia, is the contracting activity (HQ0851-21-C-0002).",
    "Date": "Oct. 30, 2020",
    "What is the company that was awarded the contract?": "Lockheed Martin Rotary and Mission Systems",
    "Where is the company that was awarded the contract located?": "Moorestown, New Jersey",
    "What is the amount awarded?": "$724,001,438",
    "What is the contract awarded for?": "full development and lifecycle engineering for the Aegis Weapon System (AWS) fielding for cruisers, destroyers and Aegis Ashore configurations",
    "Where will the work be performed?": "Moorestown, New Jersey",
    "When is the contract expected to be completed by?": "February 2024",
    "What is the contracting activity?": "Missile Defense Agency",
    "Where is the contracting activity located?": "Dahlgren, Virginia",
    "What is the contract number?": "HQ0851-21-C-0002",
    "What is the type of contract?": "sole-source, cost-plus-incentive-fee and cost-plus fixed-fee contract",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "SupplyCore Inc.,* Rockford, Illinois, has been awarded a maximum $15,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity, prime-vendor bridge contract for maintenance, repair, and operations for the North central region.  This contract was a sole-source acquisition. Location of performance is Illinois with a Feb. 27, 2015, performance completion date.  Using military services are Army, Navy, Air Force, Marine Corps, and federal civilian agencies.  Type of appropriation is fiscal 2015 defense working capital funds.  The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE8E3-15-D-0004).",
    "Date": "Nov. 28, 2014",
    "What is the company that was awarded the contract?": "SupplyCore Inc.",
    "Where is the company that was awarded the contract located?": "Rockford, Illinois",
    "What is the amount awarded?": "$15,000,000",
    "What is the contract awarded for?": "maintenance, repair, and operations for the North central region",
    "Where will the work be performed?": "Illinois",
    "When is the contract expected to be completed by?": "Feb. 27, 2015",
    "What is the contracting activity?": "Defense Logistics Agency Troop Support",
    "Where is the contracting activity located?": "Philadelphia, Pennsylvania",
    "What is the contract number?": "SPE8E3-15-D-0004",
    "What is the type of contract?": "firm-fixed-price, indefinite-delivery/indefinite-quantity, prime-vendor",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Lockheed Martin Corp., Grand Prairie, Texas, was awarded a $6,068,344,959 firm-fixed-price contract for incidental services, hardware, facilities, equipment and all technical, planning, management, manufacturing and testing efforts to produce Phased Array Tracking Radar to Intercept on Target Advanced Capability-3 missiles, missile segment enhancement configuration and associated ground support equipment and spares.  Bids were solicited via the internet with one received.  Work will be performed in Huntsville, Alabama; Camden, Arkansas; Ocala, Florida; Chelmsford, Massachusetts; Grand Prairie and Lufkin, Texas; and Archbald, Pennsylvania, with an estimated completion date of June 30, 2027.  Fiscal 2020 missile procurement (Army) funds in the amount of $6,068,344,959 were obligated at the time of the award.  U.S. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W31P4Q-20-C-0023).",
    "Date": "April 30, 2020",
    "What is the company that was awarded the contract?": "Lockheed Martin Corp.",
    "Where is the company that was awarded the contract located?": "Grand Prairie, Texas",
    "What is the amount awarded?": "$6,068,344,959",
    "What is the contract awarded for?": "incidental services, hardware, facilities, equipment and all technical, planning, management, manufacturing and testing efforts to produce Phased Array Tracking Radar to Intercept on Target Advanced Capability-3 missiles, missile segment enhancement configuration and associated ground support equipment and spares",
    "Where will the work be performed?": "Huntsville, Alabama; Camden, Arkansas; Ocala, Florida; Chelmsford, Massachusetts; Grand Prairie and Lufkin, Texas; and Archbald, Pennsylvania",
    "When is the contract expected to be completed by?": "June 30, 2027",
    "What is the contracting activity?": "U.S. Army Contracting Command, Redstone Arsenal",
    "Where is the contracting activity located?": "Alabama",
    "What is the contract number?": "W31P4Q-20-C-0023",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "BAE Systems Norfolk Ship Repair Inc., Norfolk, Virginia, is being awarded a $55,766,162 modification to a previously awarded contract (N00024-11-C-4407) for USS Wasp (LHD-1) fiscal 2017 planned maintenance availability. A planned maintenance availability includes the planning and execution of depot-level maintenance, alterations, and modifications that will update and improve the ship's military and technical capabilities. Work will be performed in Norfolk, Virginia, and is expected to be completed by May 2017. Fiscal 2017 operations and maintenance (Navy); and other procurement (Navy) funding in the amount of $55,766,162 will be obligated at time of award and $55,285,426 will expire at the end of the current fiscal year. The Mid-Atlantic Regional Maintenance Center, Norfolk, Virginia, is the administrative contracting activity.",
    "Date": "Dec. 5, 2016",
    "What is the company that was awarded the contract?": "BAE Systems Norfolk Ship Repair Inc.",
    "Where is the company that was awarded the contract located?": "Norfolk, Virginia",
    "What is the amount awarded?": "$55,766,162",
    "What is the contract awarded for?": "USS Wasp (LHD-1) fiscal 2017 planned maintenance availability.",
    "Where will the work be performed?": "Norfolk, Virginia",
    "When is the contract expected to be completed by?": "May 2017",
    "What is the contracting activity?": "Mid-Atlantic Regional Maintenance Center",
    "Where is the contracting activity located?": "Norfolk, Virginia",
    "What is the contract number?": "N00024-11-C-4407",
    "What is the type of contract?": "",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "Dawson Enterprises LLC, Honolulu, Hawaii, has been awarded a $21,357,584 firm-fixed-price contract for construction of modular buildings. Contractor will provide all site preparation and construction of modular buildings. Work will be performed at Eglin Air Force Base, Florida, and is expected to be complete by Aug. 31, 2017. This award is the result of a sole-source acquisition. Fiscal 2016 and 2017research, development, test, and evaluation funds in the amount of $12,700,000 are being obligated at the time of award. Air Force Test Center, Eglin Air Force Base, Florida, is the contracting activity (FA2823-17-C-4010).",
    "Date": "Dec. 5, 2016",
    "What is the company that was awarded the contract?": "Dawson Enterprises LLC",
    "Where is the company that was awarded the contract located?": "Honolulu, Hawaii",
    "What is the amount awarded?": "$12,700,000",
    "What is the contract awarded for?": "construction of modular buildings",
    "Where will the work be performed?": "Eglin Air Force Base, Florida,",
    "When is the contract expected to be completed by?": "Aug. 31, 2017",
    "What is the contracting activity?": "Air Force Test Center",
    "Where is the contracting activity located?": "Eglin Air Force Base, Florida",
    "What is the contract number?": "FA2823-17-C-4010",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "General Dynamics Land Systems, Sterling Heights, Michigan, has been awarded a $59,223,559 firm-fixed-price contract for new improved fire control electronics units (IFCEU); repaired and upgraded IFCEUs; and repaired and upgraded improved commanders display unit to support the M1-A2 System Enhanced Package Version 2 Field Modification program. One bid was solicited with one bid received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 28, 2022. U.S. Army Contracting Command, Warren, Michigan, is the contracting activity (W56HZV-17-D-0098).",
    "Date": "Sep. 28, 2017",
    "What is the company that was awarded the contract?": "General Dynamics Land Systems",
    "Where is the company that was awarded the contract located?": "Sterling Heights, Michigan",
    "What is the amount awarded?": "$59,223,559",
    "What is the contract awarded for?": "new improved fire control electronics units (IFCEU); repaired and upgraded IFCEUs; and repaired and upgraded improved commanders display unit to support the M1-A2 System Enhanced Package Version 2 Field Modification program",
    "Where will the work be performed?": "determined with each order",
    "When is the contract expected to be completed by?": "Sept. 28, 2022",
    "What is the contracting activity?": "U.S. Army Contracting Command",
    "Where is the contracting activity located?": "Warren, Michigan",
    "What is the contract number?": "W56HZV-17-D-0098",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Raytheon Missiles & Defense, Tucson, Arizona, is awarded a $78,665,000 firm-fixed-price modification to previously awarded contract N0002421C5408 to exercise options for additional fiscal 2022 guided missile assemblies in support of the fiscal 2021-2023 Evolved Seasparrow Missile (ESSM) Block 2 full rate production requirements. Work will be performed in Tucson, Arizona (46%); Edinburgh, Australia (8%); San Jose, California (7%); Raufoss, Norway (7%); Mississauga, Canada (6%); Ottobrunn, Germany (4%); Cambridge, Canada (3%); Nashua, New Hampshire (3%); Hengelo Ov, Netherlands (2%); Koropi Attica, Greece (2%); Torrance, California (2%); Canton, New York (2%); Ankara, Turkey (1%); Grenaa, Denmark (1%); Westlake Village, California (1%); and various other locations each less than 1% (5%), and is expected to be completed by March 2025. Fiscal 2022 weapons procurement (Navy) in the amount of $78,665,000 will be obligated at time of award and will not expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "Date": "June 23, 2022",
    "What is the company that was awarded the contract?": "Raytheon Missiles & Defense",
    "Where is the company that was awarded the contract located?": "Tucson, Arizona",
    "What is the amount awarded?": "$78,665,000",
    "What is the contract awarded for?": "additional fiscal 2022 guided missile assemblies in support of the fiscal 2021-2023 Evolved Seasparrow Missile (ESSM) Block 2 full rate production requirements",
    "Where will the work be performed?": "Tucson, Arizona (46%); Edinburgh, Australia (8%); San Jose, California (7%); Raufoss, Norway (7%); Mississauga, Canada (6%); Ottobrunn, Germany (4%); Cambridge, Canada (3%); Nashua, New Hampshire (3%); Hengelo Ov, Netherlands (2%); Koropi Attica, Greece (2%); Torrance, California (2%); Canton, New York (2%); Ankara, Turkey (1%); Grenaa, Denmark (1%); Westlake Village, California",
    "When is the contract expected to be completed by?": "March 2025",
    "What is the contracting activity?": "The Naval Sea Systems Command",
    "Where is the contracting activity located?": "Washington, D.C.",
    "What is the contract number?": "N0002421C5408",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "Capco Inc., Grand Junction, Colorado, is being awarded a $39,899,997 five-year, indefinite-delivery/indefinite-quantity contract for the manufacture of the WA83, CCU-136A/A impulse cartridge; and/or WB24, CCU-145A impulse cartridge; and/or production lot testing used for ejection devices from aircrafts. Work will be performed in Grand Junction, Colorado, and the ordering period is expected to be completed by March 2023. This effort combines purchases with fiscal 2018 ammunition procurement (Air Force; 86.56 percent); United Kingdom (2.95 percent); Korea (2.68 percent); Netherlands (2.03 percent); Austria (1.93 percent); fiscal 2018 aircraft procurement (Air Force; 1.23 percent); Australia (1.17 percent); Japan (0.99 percent); Israel (0.43 percent); and Brazil (0.03 percent), under the Foreign Military Sales program. Funds in the amount of $2,102,238 will be obligated at the time of award and funds will not expire at the end of the current fiscal year. This contract was competitively procured with the solicitation posted to the Federal Business Opportunities websiteas a 100 percent small business set-aside requirement, with one offer received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity (N00104-18-D-NF01).",
    "Date": "March 7th, 2018",
    "What is the company that was awarded the contract?": "Capco Inc",
    "Where is the company that was awarded the contract located?": "Grand Junction, Colorado",
    "What is the amount awarded?": "$39,899,997",
    "What is the contract awarded for?": "the manufacture of the WA83, CCU-136A/A impulse cartridge; and/or WB24, CCU-145A impulse cartridge; and/or production lot testing used for ejection devices from aircrafts",
    "Where will the work be performed?": "Grand Junction, Colorado",
    "When is the contract expected to be completed by?": "March 2023",
    "What is the contracting activity?": "Naval Supply Systems Command Weapon Systems Support",
    "Where is the contracting activity located?": "Mechanicsburg, Pennsylvania",
    "What is the contract number?": "N00104-18-D-NF01",
    "What is the type of contract?": "indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Physical Optics Corp.,* Torrance, California, is awarded an $8,631,282 firm-fixed-price indefinite-delivery/indefinite-quantity contract.  This contract provides for the design, test, production and delivery of up to 503 C-Band radar tracking transponders in support of the Aerial Targets program.  Work will be performed in Torrance, California, and is expected to be completed in October 2024.  No funds will be obligated at the time of award.  Funds will be obligated on individual orders as they are issued.  This contract was competitively procured as a small business set-aside via an electronic request for proposal; three offers were received.  The Naval Air Warfare Systems Command, Patuxent River, Maryland, is the contracting activity (N00019-20-D-0005).",
    "Date": "Oct. 31st, 2019",
    "What is the company that was awarded the contract?": "Physical Optics Corp.",
    "Where is the company that was awarded the contract located?": "Torrance, California",
    "What is the amount awarded?": "$8,631,282",
    "What is the contract awarded for?": "design, test, production and delivery of up to 503 C-Band radar tracking transponders in support of the Aerial Targets program",
    "Where will the work be performed?": "Torrance, California",
    "When is the contract expected to be completed by?": "October 2024",
    "What is the contracting activity?": "Naval Air Warfare Systems Command",
    "Where is the contracting activity located?": "Patuxent River, Maryland",
    "What is the contract number?": "N00019-20-D-0005",
    "What is the type of contract?": "firm-fixed-price indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Tetra Tech Inc., Norfolk, Virginia, is awarded a $90,000,000 cost-plus-award-fee modification to previously-awarded, indefinite-delivery/indefinite-quantity contract N62470-16-D-9008 to increase the maximum dollar value and extend the period of performance for comprehensive long-term environmental architect-engineering services on Navy and Marine Corps installations at sites in the Naval Facilities Engineering Systems Command Atlantic area of responsibility. This modification increases the total cumulative value of the contract to $368,000,000. Work will be performed in Maryland (13%), Pennsylvania (13%), Florida (11%), Rhode Island (8%), Washington (8%), California (7%), Massachusetts (6%), Texas (6%), Mississippi (5%), New York (4%), Maine (3%), Arizona (2%), Connecticut (2%), Indiana (2%), Louisiana (2%), New Jersey (2%), South Carolina (2%), Georgia (1%), Illinois (1%), North Carolina (1%), and Nevada (1%), and is expected to be completed by April 2022. No funds will be obligated at time of award. Funds will be obligated on individual task orders as they are issued. Task orders will be primarily funded by environmental restoration (Navy) funds. The Naval Facilities Engineering Systems Command Atlantic, Norfolk, Virginia, is the contracting activity.",
    "Date": "July 20, 2021",
    "What is the company that was awarded the contract?": "Tetra Tech Inc.",
    "Where is the company that was awarded the contract located?": "Norfolk, Virginia",
    "What is the amount awarded?": "$90,000,000",
    "What is the contract awarded for?": "increase the maximum dollar value and extend the period of performance for comprehensive long-term environmental architect-engineering services on Navy and Marine Corps installations at sites in the Naval Facilities Engineering Systems Command Atlantic area of responsibility",
    "Where will the work be performed?": "Maryland (13%), Pennsylvania (13%), Florida (11%), Rhode Island (8%), Washington (8%), California (7%), Massachusetts (6%), Texas (6%), Mississippi (5%), New York (4%), Maine (3%), Arizona (2%), Connecticut (2%), Indiana (2%), Louisiana (2%), New Jersey (2%), South Carolina (2%), Georgia (1%), Illinois (1%), North Carolina (1%), and Nevada (1%)",
    "When is the contract expected to be completed by?": "April 2022",
    "What is the contracting activity?": "Naval Facilities Engineering Systems Command Atlantic",
    "Where is the contracting activity located?": "Norfolk, Virginia",
    "What is the contract number?": "N62470-16-D-9008",
    "What is the type of contract?": "indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "Rockwell Collins Inc., Cedar Rapids, Iowa, was awarded a cost-plus-fixed-fee and firm-fixed-price, indefinite-delivery requirements contract of $21,121,700. The award will provide support that will include obsolescence, engineering reach back, repairs, buys, software and firmware updates and future electromagnetic compatibility testing. Work will be performed at the contractor’s facility in Cedar Rapids, Iowa, and is estimated to be completed by April 8, 2029. This award is the result of a sole-source acquisition and is being funded with U.S. Special Operations Command procurement funds. This is a terms and conditions basic contract with no funding obligated at time of award. Funding will be obligated with individual delivery and task orders. The contracting activities are the Air Force Life Cycle Management Center (AFLCMC)/WIUKA and AFLCMC/WIUKB, Robins Air Force Base, Warner Robins, Georgia (FA8509-24-D-0001).",
    "Date": "April 9, 2024",
    "What is the company that was awarded the contract?": "Rockwell Collins Inc.",
    "Where is the company that was awarded the contract located?": "Cedar Rapids, Iowa",
    "What is the amount awarded?": "$21,121,700",
    "What is the contract awarded for?": "provide support that will include obsolescence, engineering reach back, repairs, buys, software and firmware updates and future electromagnetic compatibility testing",
    "Where will the work be performed?": "Cedar Rapids, Iowa",
    "When is the contract expected to be completed by?": "April 8, 2029",
    "What is the contracting activity?": "Air Force Life Cycle Management Center (AFLCMC)/WIUKA and AFLCMC/WIUKB, Robins Air Force Base",
    "Where is the contracting activity located?": "Warner Robins, Georgia",
    "What is the contract number?": "FA8509-24-D-0001",
    "What is the type of contract?": "cost-plus-fixed-fee and firm-fixed-price, indefinite-delivery requirements",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "McMurdo Group, Lanham, Maryland, was awarded a $33,986,800 indefinite-delivery/indefinite-quantity contract for The Personnel Recovery Support System Personnel Recovery Device. Five bids were solicited with five bids received. Work locations and funding will be determined with each order, with an estimated completion date of March 6, 2022. U.S. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91CRB-18-D-0004).",
    "Date": "March 7, 2018",
    "What is the company that was awarded the contract?": "McMurdo Group",
    "Where is the company that was awarded the contract located?": "Lanham, Maryland",
    "What is the amount awarded?": "$33,986,800",
    "What is the contract awarded for?": "The Personnel Recovery Support System Personnel Recovery Device",
    "Where will the work be performed?": "determined with each order",
    "When is the contract expected to be completed by?": "March 6, 2022",
    "What is the contracting activity?": "U.S. Army Contracting Command",
    "Where is the contracting activity located?": "Aberdeen Proving Ground, Maryland",
    "What is the contract number?": "W91CRB-18-D-0004",
    "What is the type of contract?": "indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Northrop Grumman Aerospace Systems, Redondo Beach, California, is being awarded $21,527,216 for cost-plus fixed fee contract modification P00023 under a previously awarded contract (N00014-16-C-1009) for the Solid State High Power Laser Weapon System Demonstrator program.With award of this modification, the total cumulative value of this contract is $144,994,264.Work will be performed in Redondo Beach, California, and is expected to be completed Aug. 31, 2019.Fiscal 2017 research, development, test and evaluation (Navy) funds in the amount of $14,926,303 will be obligated at the time of award.No funds will expire at the end of the current fiscal year.The base contract was competitively procured under Office of Naval Research broad agency announcement 15-0005, with six proposals received in response to the solicitation.The Office of Naval Research, Arlington, Virginia, is the contracting activity.",
    "Date": "March 7, 2018",
    "What is the company that was awarded the contract?": "Northrop Grumman Aerospace Systems",
    "Where is the company that was awarded the contract located?": "Redondo Beach, California",
    "What is the amount awarded?": "$21,527,216",
    "What is the contract awarded for?": "cost-plus fixed fee contract modification P00023 under a previously awarded contract (N00014-16-C-1009) for the Solid State High Power Laser Weapon System Demonstrator program",
    "Where will the work be performed?": "Redondo Beach, California",
    "When is the contract expected to be completed by?": "Aug. 31, 2019",
    "What is the contracting activity?": "The Office of Naval Research",
    "Where is the contracting activity located?": "Arlington, Virginia",
    "What is the contract number?": "N00014-16-C-1009",
    "What is the type of contract?": "cost-plus fixed fee",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Insitu Inc., Bingen, Washington, is awarded a $160,317,104 firm-fixed-price, indefinite-delivery/indefinite-quantity contract. This contract provides training, test and engineering, development of engineering change proposals, operations support, organizational level maintenance, field service representatives, land and ship surveys, hardware site activations, hardware installs, repairs, and development of noncommercial software and data in support of RQ-21A Blackjack and ScanEagle unmanned aircraft platforms. Work will be performed in Bingen, Washington (88%); and various locations outside the continental U.S. (12%), and is expected to be completed in June 2026. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. The contract was not competitively procured pursuant to 10 U.S. Code 2304(c)(1). The Naval Air System Command, Patuxent River, Maryland, is the contracting activity (N0001922D0038).",
    "Date": "July 19, 2022",
    "What is the company that was awarded the contract?": "Insitu Inc.",
    "Where is the company that was awarded the contract located?": "Bingen, Washington",
    "What is the amount awarded?": "$160,317,104",
    "What is the contract awarded for?": "training, test and engineering, development of engineering change proposals, operations support, organizational level maintenance, field service representatives, land and ship surveys, hardware site activations, hardware installs, repairs, and development of noncommercial software and data in support of RQ-21A Blackjack and ScanEagle unmanned aircraft platforms",
    "Where will the work be performed?": "Bingen, Washington",
    "When is the contract expected to be completed by?": "June 2026",
    "What is the contracting activity?": "Naval Air System Command",
    "Where is the contracting activity located?": "Patuxent River, Maryland",
    "What is the contract number?": "N0001922D0038",
    "What is the type of contract?": "firm-fixed-price, indefinite-delivery/indefinite-quantity contract",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Tecan US Inc., Morrisville, North Carolina, has been awarded a $32,862,500 firm-fixed-price contract for robotic pipette tips.  The scope of this contract effort includes the expansion of the U.S. domestic production capacity for robotic pipette tips by standing up infrastructure and increasing production capacity with Tecan US Inc.  The COVID-19 pandemic has created a requirement for additional near term diagnostic testing capability which significantly exceeds manufacturing capacity of sample collection and processing consumables.  This project will create Tecan’s capacity to produce up to 40 million pipette tips per month domestically.  Work will be completed in Morrisville, North Carolina, and is expected to be completed November 2022.  This award is the result of a Commercial Solutions Opening (CSO) request issued by the Joint Rapid Acquisition Cell (JRAC) and is a full and open competition.  The solicitation was published by Department of Health and Human Services and JRAC in the CSO in August 2020.  Fiscal other procurement funds are being used on this contract.  The Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA8730-20-S-0003).",
    "Date": "Oct. 26, 2020",
    "What is the company that was awarded the contract?": "Tecan US Inc.",
    "Where is the company that was awarded the contract located?": "Morrisville, North Carolina",
    "What is the amount awarded?": "$32,862,500",
    "What is the contract awarded for?": "the expansion of the U.S. domestic production capacity for robotic pipette tips by standing up infrastructure and increasing production capacity with Tecan US Inc.",
    "Where will the work be performed?": "Morrisville, North Carolina",
    "When is the contract expected to be completed by?": "November 2022",
    "What is the contracting activity?": "Air Force Life Cycle Management Center",
    "Where is the contracting activity located?": "Hanscom Air Force Base, Massachusetts",
    "What is the contract number?": "FA8730-20-S-0003",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "DRS Advanced ISR LLC, Beavercreek, Ohio, was awarded a $15,730,000 firm-fixed-price contract for the sustainment to include engineering change proposals for obsolescence, procurement of spares, retrofit kits, test program kits, test program sets, and other engineering logistics services for the AN/URC-145A(V) Joint Tactical Terminal-Integrated Broadcast Service. One bid was solicited and one bid received. Work will be performed in Beavercreek, Ohio, with an estimated completion date of June 30, 2022. Fiscal 2017 other procurement (Army) will be determined with each order. U.S. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W56KGY-17-D-0017).",
    "Date": "July 5, 2017",
    "What is the company that was awarded the contract?": "DRS Advanced ISR LLC",
    "Where is the company that was awarded the contract located?": "Beavercreek, Ohio",
    "What is the amount awarded?": "$15,730,000",
    "What is the contract awarded for?": "the sustainment to include engineering change proposals for obsolescence, procurement of spares, retrofit kits, test program kits, test program sets, and other engineering logistics services for the AN/URC-145A(V) Joint Tactical Terminal-Integrated Broadcast Service",
    "Where will the work be performed?": "Beavercreek, Ohio",
    "When is the contract expected to be completed by?": "June 30, 2022",
    "What is the contracting activity?": "U.S. Army Contracting Command",
    "Where is the contracting activity located?": "Aberdeen Proving Ground, Maryland",
    "What is the contract number?": "W56KGY-17-D-0017",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Pratt & Whitney Military Engines, East Hartford, Connecticut, has been awarded a maximum $15,000,000 time and materials contract for program and engineering labor hours for warming up TF-33 cold start parts. This was a sole-source acquisition using justification 10 U.S. Code 2304 (c)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a one-year contract with no option periods. Location of performance is Connecticut, with a Feb. 10, 2023, performance completion date. Using military service is Air Force. Type of appropriation is fiscal 2022 through 2023 defense working capital funds and appropriated funds. The contracting activity is the Defense Logistics Agency Aviation, Richmond, Virginia (SPE4A2-22-D-0004).",
    "Date": "Feb. 11, 2022",
    "What is the company that was awarded the contract?": "Pratt & Whitney Military Engines",
    "Where is the company that was awarded the contract located?": "East Hartford, Connecticut",
    "What is the amount awarded?": "$15,000,000",
    "What is the contract awarded for?": "program and engineering labor hours for warming up TF-33 cold start parts",
    "Where will the work be performed?": "Connecticut",
    "When is the contract expected to be completed by?": "Feb. 10, 2023",
    "What is the contracting activity?": "Defense Logistics Agency Aviation",
    "Where is the contracting activity located?": "Richmond, Virginia",
    "What is the contract number?": "SPE4A2-22-D-0004",
    "What is the type of contract?": "time and materials",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Northrop Grumman Systems Corp., Melbourne, Florida, is awarded a $12,970,550 modification (P00005) to a cost-plus-fixed-fee order (N0001920F5008) against a previously issued basic ordering agreement (N0001920G0005). This modification exercises an option to provide continued support for integrated test team operations in executing advanced development experimentation flights and development testing in support of future delta system software builds for the Navy E-2D Advanced Hawkeye aircraft.  Work will be performed in Patuxent River, Maryland, and is expected to be completed in July 2022.  Fiscal 2021 research, development, test and evaluation (Navy) funds in the amount of $1,632,077 will be obligated at time of award, none of which will expire at the end of the current fiscal year. The Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "Date": "July 2, 2021",
    "What is the company that was awarded the contract?": "Northrop Grumman Systems Corp.",
    "Where is the company that was awarded the contract located?": "Melbourne, Florida",
    "What is the amount awarded?": "$12,970,550",
    "What is the contract awarded for?": "continued support for integrated test team operations in executing advanced development experimentation flights and development testing in support of future delta system software builds for the Navy E-2D Advanced Hawkeye aircraft",
    "Where will the work be performed?": "Patuxent River, Maryland",
    "When is the contract expected to be completed by?": "July 2022",
    "What is the contracting activity?": "Naval Air Systems Command",
    "Where is the contracting activity located?": "Patuxent River, Maryland",
    "What is the contract number?": "N0001920F5008",
    "What is the type of contract?": "cost-plus-fixed-fee",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "MW Builders Inc., Pflugerville, Texas, was awarded a $36,514,000 firm-fixed-price contract to design and construct a new unaccompanied enlisted personnel housing facility. Bids were solicited via the internet with four received. Work will be performed in Fort Hood, Texas, with an estimated completion date of July 3, 2023. Fiscal 2020 military construction, Army funds in the amount of $36,514,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Fort Worth, Texas, is the contracting activity (W9126G-21-C-0014).",
    "Date": "July 2, 2021",
    "What is the company that was awarded the contract?": "MW Builders Inc.",
    "Where is the company that was awarded the contract located?": "Pflugerville, Texas",
    "What is the amount awarded?": "$36,514,000",
    "What is the contract awarded for?": "design and construct a new unaccompanied enlisted personnel housing facility",
    "Where will the work be performed?": "Fort Hood, Texas",
    "When is the contract expected to be completed by?": "July 3, 2023",
    "What is the contracting activity?": "U.S. Army Corps of Engineers",
    "Where is the contracting activity located?": "Fort Worth, Texas",
    "What is the contract number?": "W9126G-21-C-0014",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Communication & Power Industries (Econco division), Woodland, California, is awarded $28,152,432 for a firm-fixed-price requirements contract for the repair of single switch tubes and double duty switch tubes that are components of the AN/SPY radar systems in support of the Aegis Combat System. This is a five-year contract with no options. All work will be performed in Woodland, California, and the ordering period is expected to be completed by September 2028. Working capital funds (Navy) will be obligated as individual task orders are issued, and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity (N00104-23-D-SX02).",
    "Date": "Sept. 14, 2023",
    "What is the company that was awarded the contract?": "Communication & Power Industries (Econco division)",
    "Where is the company that was awarded the contract located?": "Woodland, California",
    "What is the amount awarded?": "$28,152,432",
    "What is the contract awarded for?": "the repair of single switch tubes and double duty switch tubes that are components of the AN/SPY radar systems in support of the Aegis Combat System",
    "Where will the work be performed?": "Woodland, California",
    "When is the contract expected to be completed by?": "September 2028",
    "What is the contracting activity?": "Naval Supply Systems Command Weapon Systems Support",
    "Where is the contracting activity located?": "Mechanicsburg, Pennsylvania",
    "What is the contract number?": "N00104-23-D-SX02",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Baron Communications,* Newport News, Virginia, is awarded a $10,494,756 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for electrical maintenance and repair services. This contract provides for facility investment services for electrical maintenance and repair services. Work will be performed at Naval Station Norfolk, Virginia (73%); Norfolk Naval Shipyard, Virginia (22%); Naval Weapon Station Yorktown, Virginia (3%); Naval Air Station Oceana, Virginia (1%); Joint Expeditionary Base Little Creek-Fort Story, Virginia (1%); and other Hampton Roads, Virginia, locations and is expected to be completed by September 2024. Fiscal 2023 operation and maintenance (Navy) funds in the amount of $97,479 will be obligated via recurring work task order issued at time of award and will expire at the end of the current fiscal year. This contract was competitively procured via the sam.gov website, with two offers received. Naval Facilities Engineering Systems Command, Mid-Atlantic, Norfolk, Virginia, is the contracting activity (N4008523D2502).",
    "Date": "Sept. 14, 2023",
    "What is the company that was awarded the contract?": "Baron Communications",
    "Where is the company that was awarded the contract located?": "Newport News, Virginia",
    "What is the amount awarded?": "$10,494,756",
    "What is the contract awarded for?": "electrical maintenance and repair services",
    "Where will the work be performed?": "Naval Station Norfolk, Virginia (73%); Norfolk Naval Shipyard, Virginia (22%); Naval Weapon Station Yorktown, Virginia (3%); Naval Air Station Oceana, Virginia (1%); Joint Expeditionary Base Little Creek-Fort Story, Virginia (1%); and other Hampton Roads, Virginia, locations",
    "When is the contract expected to be completed by?": "September 2024",
    "What is the contracting activity?": "Naval Facilities Engineering Systems Command, Mid-Atlantic",
    "Where is the contracting activity located?": "Norfolk, Virginia",
    "What is the contract number?": "N4008523D2502",
    "What is the type of contract?": "firm-fixed-price, indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Orbital Research Inc., Cleveland, Ohio, was awarded an $8,257,426 firm-fixed-price contract for 1,700 drop-glide munitions, and 24 unmanned aerial systems and weapon release systems. Bids was solicited via the internet with one received. Work will be performed in Benning, Georgia; Picatinny, New Jersey; and Twenty-Nine Palms, California, with an estimated completion date of Sept. 22, 2023. Fiscal 2022 procurement, Defense-Wide funds in the amount of $1,535,698 were obligated at the time of the award. U.S. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W56HZV-22-C-0073).",
    "Date": "Sept. 23, 2022",
    "What is the company that was awarded the contract?": "Orbital Research Inc.",
    "Where is the company that was awarded the contract located?": "Cleveland, Ohio",
    "What is the amount awarded?": "$8,257,426",
    "What is the contract awarded for?": "1,700 drop-glide munitions, and 24 unmanned aerial systems and weapon release systems",
    "Where will the work be performed?": "Benning, Georgia; Picatinny, New Jersey; and Twenty-Nine Palms, California",
    "When is the contract expected to be completed by?": "Sept. 22, 2023",
    "What is the contracting activity?": "U.S. Army Contracting Command",
    "Where is the contracting activity located?": "Detroit Arsenal, Michigan",
    "What is the contract number?": "W56HZV-22-C-0073",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Oregon Department of Fish and Wildlife, Salem, Oregon, was awarded a $7,887,876 modification (P00004) to contract W9127N-20-C-0028 for electric power support. Work will be performed in Trail, Oregon, with an estimated completion date of Aug. 31, 2023. Fiscal 2022 other procurement, Army funds in the amount of $7,887,876 were obligated at the time of the award. U.S. Army Corps of Engineers, Portland, Oregon, is the contracting activity.",
    "Date": "Sept. 23, 2022",
    "What is the company that was awarded the contract?": "Oregon Department of Fish and Wildlife",
    "Where is the company that was awarded the contract located?": "Salem, Oregon",
    "What is the amount awarded?": "$7,887,876",
    "What is the contract awarded for?": "electric power support",
    "Where will the work be performed?": "Trail, Oregon",
    "When is the contract expected to be completed by?": "Aug. 31, 2023",
    "What is the contracting activity?": "U.S. Army Corps of Engineers",
    "Where is the contracting activity located?": "Portland, Oregon",
    "What is the contract number?": "W9127N-20-C-0028",
    "What is the type of contract?": "",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "PC Mechanical Inc., Santa Maria, California, is awarded a $62,000,000 indefinite-delivery/indefinite-quantity contract for equipment support services (ESS) supporting the civil engineering support equipment (CESE) at Naval Base Ventura County, Naval Base San Diego, and Naval Construction Battalion Center. Work will be performed in Santa Maria, California (75%); and Gulfport, Mississippi (25%). No task orders are being issued at this time. The term of the contract is not to exceed 60 months with a six-month option. Expected completion date of February 2027. The work to be performed is for ESS on CESE assets in contiguous U.S. locations. The contractor shall provide all labor, training, management, for the inspections, preventative maintenance, refurbishment, repairs, overhauls, upgrades, modernization, modifications, and logistics management information services provided to support of naval expeditionary equipment assets. Fiscal 2021 operation and maintenance (Navy) contract funds in the amount of $10,000 will be obligated after award and will expire at the end of the current fiscal year. Future task orders will be primarily funded by operations and maintenance (Navy). This contract was competitively procured via the system for Award Management Contract Opportunities website with one proposal received. The Naval Facilities Engineering Systems and Expeditionary Warfare Center, Port Hueneme, California, is the contracting activity (N39430-21-D-2207).",
    "Date": "Aug. 17, 2021",
    "What is the company that was awarded the contract?": "PC Mechanical Inc.",
    "Where is the company that was awarded the contract located?": "Santa Maria, California",
    "What is the amount awarded?": "$62,000,000",
    "What is the contract awarded for?": "equipment support services (ESS) supporting the civil engineering support equipment (CESE) at Naval Base Ventura County, Naval Base San Diego, and Naval Construction Battalion Center",
    "Where will the work be performed?": "Santa Maria, California (75%); and Gulfport, Mississippi (25%)",
    "When is the contract expected to be completed by?": "February 2027",
    "What is the contracting activity?": "Naval Facilities Engineering Systems and Expeditionary Warfare Center",
    "Where is the contracting activity located?": "Port Hueneme, California",
    "What is the contract number?": "N39430-21-D-2207",
    "What is the type of contract?": "indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "B. L. Harbert International, Birmingham, Alabama, is awarded a $32,873,962 firm-fixed-price task order (N6945021F0566) under a multiple award construction contract for hangar renovations and repairs at Naval Air Station Corpus Christi, Texas. The task order also contains one unexercised option, which if exercised would increase the cumulative task order value to $33,696,344. Work will be performed in Corpus Christi, Texas, and is expected to be completed by November 2023.  The work to be performed provides for the repair, and renovation of Corpus Christi Army Depot Hangar 47.  Work includes miscellaneous site work, structural stabilization, removal and replacement of the exterior envelope, renovation of the hangar bay and the office lean-to wings, the provision of two elevators, removal and replacement of building systems such as heating, ventilation, and air conditioning, power and lighting and telecommunication systems.  The option, if exercised, provides for work on exterior trench drains, piping and the retention area. Fiscal 2021 operation and maintenance (Army) funds in the amount of $32,873,962 are obligated on this award and will expire at the end of current fiscal year. Three proposals were received for this task order.  The Naval Facilities Engineering Systems Command, Southeast, Jacksonville, Florida, is the contracting activity (N69450-19-D-0908).",
    "Date": "Aug. 17, 2021",
    "What is the company that was awarded the contract?": "B. L. Harbert International",
    "Where is the company that was awarded the contract located?": "Birmingham, Alabama",
    "What is the amount awarded?": "$32,873,962",
    "What is the contract awarded for?": "hangar renovations and repairs at Naval Air Station Corpus Christi, Texas",
    "Where will the work be performed?": "Corpus Christi, Texas",
    "When is the contract expected to be completed by?": "November 2023",
    "What is the contracting activity?": "Naval Facilities Engineering Systems Command, Southeast",
    "Where is the contracting activity located?": "Jacksonville, Florida",
    "What is the contract number?": "N69450-19-D-0908",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Stratascor LLC, Virginia Beach, Virginia, is awarded a $210,000,000 indefinite-delivery/indefinite-quantity, fixed-price contract for command, control, communications, and computer system afloat operations and sustainment support for capabilities aboard the Military Sealift Command (MSC) fleet of ships, and the MSC network operations centers. This contract includes a five-year ordering period. Work will be performed in Norfolk, Virginia, and is scheduled to commence Jan. 1, 2018, and is expected to be completed Dec. 31, 2023.  Navy working capital funds and U.S. Transportation Command working capital funds in the amount of $500,000 will be obligated at the time of award.  Funds will not expire at the end of the current fiscal year.  This contract was competitively procured, with proposals solicited via the Federal Business Opportunities website, with five offers received.  The Navy’s Military Sealift Command, Norfolk, Virginia, is the contracting activity (N3220519D1000).",
    "Date": "Nov. 21, 2018",
    "What is the company that was awarded the contract?": "Stratascor LLC",
    "Where is the company that was awarded the contract located?": "Virginia Beach, Virginia",
    "What is the amount awarded?": "$210,000,000",
    "What is the contract awarded for?": "command, control, communications, and computer system afloat operations and sustainment support for capabilities aboard the Military Sealift Command (MSC) fleet of ships, and the MSC network operations centers",
    "Where will the work be performed?": "Norfolk, Virginia",
    "When is the contract expected to be completed by?": "Dec. 31, 2023",
    "What is the contracting activity?": "Navy’s Military Sealift Command",
    "Where is the contracting activity located?": "Norfolk, Virginia",
    "What is the contract number?": "N3220519D1000",
    "What is the type of contract?": "indefinite-delivery/indefinite-quantity, fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Offshore Service Vessels LLC, Cut Off, Louisiana, is awarded a $10,493,750 firm-fixed-price contract with reimbursable elements for the West Coast Naval Special Warfare submarine support vessel MV Alyssa Chouest. This vessel will be utilized to launch and recover submersibles, divers and small craft. This contract includes a 12-month base period, three 12-month option periods, and one 11-month option period.  If all options are exercised this would bring the cumulative value of the contract to $54,238,356.  Work will be performed in Pearl Harbor, Hawaii, and at sea, and is expected to be completed July 9, 2020. If all options are exercised, work will continue through June 8, 2024.  Fiscal 2019 Navy working capital funds in the amount of $2,415,000 will be obligated at the time of award, and will expire at the end of the current fiscal year.  This contract was competitively procured with 50 plus proposals solicited via the Federal Business Opportunities website, with six offers received. The Navy’s Military Sealift Command Norfolk, Virginia, is the contracting activity (N3220519C3518).",
    "Date": "Nov. 21, 2018",
    "What is the company that was awarded the contract?": "Offshore Service Vessels LLC",
    "Where is the company that was awarded the contract located?": "Cut Off, Louisiana",
    "What is the amount awarded?": "$10,493,750",
    "What is the contract awarded for?": "the West Coast Naval Special Warfare submarine support vessel MV Alyssa Chouest",
    "Where will the work be performed?": "Pearl Harbor, Hawaii",
    "When is the contract expected to be completed by?": "July 9, 2020",
    "What is the contracting activity?": "Navy’s Military Sealift Command",
    "Where is the contracting activity located?": "Norfolk, Virginia",
    "What is the contract number?": "N3220519C3518",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "The Boeing Co., St. Louis, Missouri, is awarded a $10,802,192 modification (P00012) to a cost-plus-fixed-fee order (N0001917F0005) against a previously issued basic ordering agreement (N0001916G0001). This modification exercises options to procure 359 Primary Bleed Air Pressure Regulator (PBAR) valves in support of the Environmental Control System PBAR and Shut Off Valve Improvement modifications to the F/A-18 E/F and EA-18G aircraft. Work will be performed in Windsor, Connecticut (80%); El Segundo, California (12%); and St. Louis, Missouri (8%), and is expected to be completed in June 2024. Fiscal 2022 aircraft procurement (Navy) funds in the amount of $10,802,192 will be obligated at time of award, none of which will expire at the end of the current fiscal year. The Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "Date": "April 12, 2022",
    "What is the company that was awarded the contract?": "The Boeing Co.",
    "Where is the company that was awarded the contract located?": "St. Louis, Missouri",
    "What is the amount awarded?": "$10,802,192",
    "What is the contract awarded for?": "359 Primary Bleed Air Pressure Regulator (PBAR) valves in support of the Environmental Control System PBAR and Shut Off Valve Improvement modifications to the F/A-18 E/F and EA-18G aircraft",
    "Where will the work be performed?": "Windsor, Connecticut (80%); El Segundo, California (12%); and St. Louis, Missouri (8%)",
    "When is the contract expected to be completed by?": "June 2024",
    "What is the contracting activity?": "Naval Air Systems Command",
    "Where is the contracting activity located?": "Patuxent River, Maryland",
    "What is the contract number?": "N0001917F0005",
    "What is the type of contract?": "cost-plus-fixed-fee",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "Raytheon Integrated Defense Systems, Portsmouth, Rhode Island, is awarded an $8,230,603 cost-plus-fixed-fee modification to previously awarded contract N00024-16-C-5418 to exercise options for NATO Sea Sparrow missile system design agent engineering and technical support services. Work will be performed in Portsmouth, Rhode Island (94%); Marlborough, Massachusetts (3%); and San Diego, California (3%), and is expected to be completed by November 2020. Fiscal 2018 other procurement (Navy); fiscal 2019 research, development, test and evaluation (Navy); non-expiring other funds; and Foreign Military Sales funding in the amount of $4,251,731 will be obligated at time of award, and $2,162,681 will expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, District of Columbia, is the contracting activity.",
    "Date": "Nov. 22, 2019",
    "What is the company that was awarded the contract?": "Raytheon Integrated Defense Systems",
    "Where is the company that was awarded the contract located?": "Portsmouth, Rhode Island",
    "What is the amount awarded?": "$8,230,603",
    "What is the contract awarded for?": "NATO Sea Sparrow missile system design agent engineering and technical support services",
    "Where will the work be performed?": "Portsmouth, Rhode Island (94%); Marlborough, Massachusetts (3%); and San Diego, California (3%)",
    "When is the contract expected to be completed by?": "November 2020",
    "What is the contracting activity?": "Naval Sea Systems Command",
    "Where is the contracting activity located?": "Washington, District of Columbia",
    "What is the contract number?": "N00024-16-C-5418",
    "What is the type of contract?": "cost-plus-fixed-fee",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "ENGlobal Government Services Inc., Tulsa, Oklahoma, has been awarded a maximum $11,552,569 cost-plus-fixed-fee, bridge contract for automated fuel handling maintenance. This was a sole-source acquisition using justification 10 U.S .Code 2304 (c)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a 15-month base contract with one three-month option period. Locations of performance are Virginia, Georgia, Hawaii, California, Washington, Florida, North Carolina, South Carolina, Oklahoma, Spain, Greenland and Japan, with a May 12, 2021, performance completion date. Using military services are Army, Navy, Air Force, Marine Corps, National Guard and Coast Guard. Type of appropriation is fiscal 2020 through 2021 defense working capital funds. The contracting activity is the Defense Logistics Agency Contracting Services Office, Columbus, Ohio (SP4702-20-C-0002).",
    "Date": "Nov. 22, 2019",
    "What is the company that was awarded the contract?": "ENGlobal Government Services Inc.",
    "Where is the company that was awarded the contract located?": "Tulsa, Oklahoma",
    "What is the amount awarded?": "$11,552,569",
    "What is the contract awarded for?": "automated fuel handling maintenance",
    "Where will the work be performed?": "Virginia, Georgia, Hawaii, California, Washington, Florida, North Carolina, South Carolina, Oklahoma, Spain, Greenland and Japan",
    "When is the contract expected to be completed by?": "May 12, 2021",
    "What is the contracting activity?": "Defense Logistics Agency Contracting Services Office",
    "Where is the contracting activity located?": "Columbus, Ohio",
    "What is the contract number?": "SP4702-20-C-0002",
    "What is the type of contract?": "cost-plus-fixed-fee",
    "Is this a modification to a previous contract?": ""
  },
  {
    "Context": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is being awarded a $257,780,849 firm-fixed-price modification to the previously awarded low-rate initial production lot 10 F-35 Lightning II advance acquisition contract (N00019-15-C-0003).  This modification provides the procurement of 129 alternate mission equipment for the Air Force (54); Navy and Marine Corps (11); foreign military sales (FMS); and international partners (39); 468 pilot flight equipment for the Air Force (203); Navy and Marine Corps (131); and FMS and international partners (134); and 94 red gear for the Air Force (44); Navy and Marine Corps (11); FMS; and international partners (39), to support the F-35 Joint Strike Fighter production.  Work will be performed in Inglewood, California (60 percent); White Plains, New York (25 percent); St. Petersburg, Florida (5 percent); Orlando, Florida (5 percent); and Fort Worth, Texas (5 percent), and is expected to be completed in June 2020.  Fiscal 2016 aircraft procurement (Air Force, Navy, Marine Corps); international partner; and FMS funds in the amount of $257,780,849 are being obligated at time of award, none of which will expire at the end of the current fiscal year.  This order combines purchases for the Air Force ($122,909,691; 47.7 percent); Marine Corps ($40,406,910; 15.6 percent); Navy ($10,285,742; 4.0 percent); international partners ($60,260,604; 23.4 percent); and FMS customers ($23,917,602; 9.3 percent) under the Foreign Military Sales program.  The Naval Air Systems Command, Patuxent River, Maryland is the contracting activity.",
    "Date": "June 28, 2017",
    "What is the company that was awarded the contract?": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co.",
    "Where is the company that was awarded the contract located?": "Fort Worth, Texas",
    "What is the amount awarded?": "$257,780,849",
    "What is the contract awarded for?": "the procurement of 129 alternate mission equipment for the Air Force (54); Navy and Marine Corps (11); foreign military sales (FMS); and international partners (39); 468 pilot flight equipment for the Air Force (203); Navy and Marine Corps (131); and FMS and international partners (134); and 94 red gear for the Air Force (44); Navy and Marine Corps (11); FMS; and international partners (39), to support the F-35 Joint Strike Fighter production",
    "Where will the work be performed?": "Inglewood, California (60 percent); White Plains, New York (25 percent); St. Petersburg, Florida (5 percent); Orlando, Florida (5 percent); and Fort Worth, Texas (5 percent)",
    "When is the contract expected to be completed by?": "June 2020",
    "What is the contracting activity?": "Naval Air Systems Command",
    "Where is the contracting activity located?": "Patuxent River, Maryland",
    "What is the contract number?": "N00019-15-C-0003",
    "What is the type of contract?": "firm-fixed-price",
    "Is this a modification to a previous contract?": "modification"
  },
  {
    "Context": "Fluor Federal Solutions LLC, Greenville, South Carolina, is being awarded a $48,097,133 modification under a previously awarded indefinite-delivery/indefinite-quantity contract (N69450-12-D-7582) to exercise option three for base operations support services at various installations in the Naval Facilities Engineering Command Southeast area of responsibility.  The work to be performed provides for regional base operating support services including, but not limited to, the following functions: port operations, facilities support services, facility investment, base support vehicles and equipment, and environmental.  After award of this option, the total cumulative contract value will be $275,552,389.  Work will be performed in Jacksonville, Florida, and is expected to be completed June 2018.  No funds will be obligated at time of award.  Fiscal 2017 operations and maintenance (Navy and Marine Corps); 2017 Navy working capital funds; 2017 defense health program; and 2017 family housing operations and maintenance (Navy) contract funds in the amount of $38,952,862 for recurring work will be obligated on individual task orders issued during the option period.  The Naval Facilities Engineering Command, Southeast, Jacksonville, Florida, is the contracting activity.",
    "Date": "June 28, 2017",
    "What is the company that was awarded the contract?": "Fluor Federal Solutions LLC",
    "Where is the company that was awarded the contract located?": "Greenville, South Carolina",
    "What is the amount awarded?": "$48,097,133",
    "What is the contract awarded for?": "regional base operating support services including, but not limited to, the following functions: port operations, facilities support services, facility investment, base support vehicles and equipment, and environmental",
    "Where will the work be performed?": "Jacksonville, Florida",
    "When is the contract expected to be completed by?": "June 2018",
    "What is the contracting activity?": "Naval Facilities Engineering Command, Southeast",
    "Where is the contracting activity located?": "Jacksonville, Florida",
    "What is the contract number?": "N69450-12-D-7582",
    "What is the type of contract?": "indefinite-delivery/indefinite-quantity",
    "Is this a modification to a previous contract?": "modification"
  }
]